#+TITLE: Syllabus for  CIS 300 Foundations of Computer Science
#+AUTHOR: Brian C. Ladd
#+DATE: Spring 2016
#+STARTUP: showall
#+TODO: TODO COLLECTED | GRADED
#+TODO: TODO | DONE

** GRADED assignment:survey-emacs-shortcuts			 :assignment:
   CLOSED: [2016-10-24 Mon 13:01] DEADLINE: <2016-10-19 Wed>
   :PROPERTIES:
   :CATEGORY: participation
   :POINTS:   1
   :CUSTOM_ID: survey-emacs-shortcuts
   :RUBRIC:   (("participation" . 1.0))
   :END:

new template for code blocks.
#+BEGIN_SRC emacs-lisp :results silent
(add-to-list 'org-structure-template-alist
	     '("Py" "#+BEGIN_SRC python :results output org drawer
import numpy as np
import matplotlib.pyplot as plt
import pycse.orgmode as org
from scipy.optimize import fsolve
from scipy.integrate import odeint
from pycse import odelay

?
\n#+END_SRC"
	       "<src lang=\"python\">\n?\n</src>"))
#+END_SRC


Change how links get opened.
#+BEGIN_SRC emacs-lisp
(setf (cdr (assoc 'file org-link-frame-setup)) 'find-file)
#+END_SRC

#+RESULTS:
: find-file

Turn on automatic bracket matching
#+BEGIN_SRC emacs-lisp
(electric-pair-mode 1)
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
(defun oscratch ()
 (interactive)
 (switch-to-buffer "*Oh scratch, no you didn't*")
 (org-mode))
#+END_SRC

#+RESULTS:
: oscratch


autopep8

Needs to have autopep8 installed in python
I think it is
#+BEGIN_SRC sh
pip install autopep8
#+END_SRC

#+RESULTS:
| Requirement | already | satisfied | (use | --upgrade | to | upgrade): | autopep8    | in | /Users/jkitchin/anaconda3/lib/python3.5/site-packages |       |           |
| Requirement | already | satisfied | (use | --upgrade | to | upgrade): | pep8>=1.5.7 | in | /Users/jkitchin/anaconda3/lib/python3.5/site-packages | (from | autopep8) |

M-x autopep8
#+BEGIN_SRC python :results output org drawer
a = 4  # bad comment
b = 5
c = a + 5 * b - a * 6 / 34
d = (3, 4, 5, 6, 7, 8)


def f(x, y, z):
    return x * y * z

print(c)
#+END_SRC

C-u C-u C-c C-x C-l to make latex images in whole buffer

